       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-22.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 WS-MESSAGE PIC X(40) VALUE "Hello from COBOL_22".

       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY WS-MESSAGE
           STOP RUN.
