         TITLE 'GSTK007M - MAPSET HISTORIQUE MOUVEMENTS'
*======================================================================*
* MAPSET  : GSTK007M                                                   *
* MAP     : GSTK007                                                    *
* ECRAN   : HISTORIQUE DES MOUVEMENTS DE STOCK                        *
* TAILLE  : 24 x 132  (3270 Model 5)                                  *
* TRANS   : G007                                                       *
*======================================================================*
GSTK007M DFHMSD TYPE=&SYSPARM,                                         X
               LANG=COBOL,                                             X
               MODE=INOUT,                                             X
               TIOAPFX=YES
*
GSTK007  DFHMDI SIZE=(24,132),                                         X
               LINE=1,                                                 X
               COLUMN=1
*
         DFHMDF POS=(2,2),LENGTH=32,ATTRB=(ASKIP,BRT),                X
               INITIAL='GSTK007 - HISTORIQUE MOUVEMENTS'
DATHR    DFHMDF POS=(2,111),LENGTH=19,ATTRB=(ASKIP,NORM)
*
*-- FILTRES : CODE ARTICLE, DATE DEBUT, DATE FIN, TYPE
         DFHMDF POS=(4,1),LENGTH=11,ATTRB=(ASKIP,NORM),               X
               INITIAL='CODE ART ['
FILCO    DFHMDF POS=(4,12),LENGTH=10,ATTRB=(UNPROT,NORM)
         DFHMDF POS=(4,23),LENGTH=11,ATTRB=(ASKIP,NORM),              X
               INITIAL='] DU DATE ['
FILDE    DFHMDF POS=(4,35),LENGTH=10,ATTRB=(UNPROT,NORM)
         DFHMDF POS=(4,46),LENGTH=10,ATTRB=(ASKIP,NORM),              X
               INITIAL='] AU DATE ['
FILDF    DFHMDF POS=(4,57),LENGTH=10,ATTRB=(UNPROT,NORM)
         DFHMDF POS=(4,68),LENGTH=8,ATTRB=(ASKIP,NORM),               X
               INITIAL='] TYPE ['
FILTP    DFHMDF POS=(4,77),LENGTH=10,ATTRB=(UNPROT,NORM)
         DFHMDF POS=(4,88),LENGTH=1,ATTRB=(ASKIP,NORM),INITIAL=']'
*
*-- EN-TETES COLONNES
*   DATE(10) HEURE(8) TYPE(10) S(1) CODE(10) DESIG(20) QTE(8) MHT(12) OPE(8)
         DFHMDF POS=(6,1),LENGTH=10,ATTRB=(ASKIP,BRT),                X
               INITIAL='DATE'
         DFHMDF POS=(6,12),LENGTH=8,ATTRB=(ASKIP,BRT),                X
               INITIAL='HEURE'
         DFHMDF POS=(6,21),LENGTH=11,ATTRB=(ASKIP,BRT),               X
               INITIAL='TYPE'
         DFHMDF POS=(6,32),LENGTH=2,ATTRB=(ASKIP,BRT),INITIAL='S'
         DFHMDF POS=(6,35),LENGTH=11,ATTRB=(ASKIP,BRT),               X
               INITIAL='CODE ART.'
         DFHMDF POS=(6,47),LENGTH=21,ATTRB=(ASKIP,BRT),               X
               INITIAL='DESIGNATION'
         DFHMDF POS=(6,68),LENGTH=9,ATTRB=(ASKIP,BRT),                X
               INITIAL='QUANTITE'
         DFHMDF POS=(6,78),LENGTH=13,ATTRB=(ASKIP,BRT),               X
               INITIAL='MONTANT HT'
         DFHMDF POS=(6,92),LENGTH=9,ATTRB=(ASKIP,BRT),                X
               INITIAL='OPERATEUR'
*
*-- 10 LIGNES MOUVEMENTS
DT01     DFHMDF POS=(7,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE01     DFHMDF POS=(7,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP01     DFHMDF POS=(7,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN01     DFHMDF POS=(7,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC01     DFHMDF POS=(7,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS01     DFHMDF POS=(7,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT01     DFHMDF POS=(7,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH01     DFHMDF POS=(7,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP01     DFHMDF POS=(7,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT02     DFHMDF POS=(8,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE02     DFHMDF POS=(8,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP02     DFHMDF POS=(8,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN02     DFHMDF POS=(8,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC02     DFHMDF POS=(8,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS02     DFHMDF POS=(8,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT02     DFHMDF POS=(8,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH02     DFHMDF POS=(8,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP02     DFHMDF POS=(8,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT03     DFHMDF POS=(9,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE03     DFHMDF POS=(9,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP03     DFHMDF POS=(9,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN03     DFHMDF POS=(9,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC03     DFHMDF POS=(9,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS03     DFHMDF POS=(9,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT03     DFHMDF POS=(9,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH03     DFHMDF POS=(9,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP03     DFHMDF POS=(9,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT04     DFHMDF POS=(10,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE04     DFHMDF POS=(10,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP04     DFHMDF POS=(10,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN04     DFHMDF POS=(10,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC04     DFHMDF POS=(10,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS04     DFHMDF POS=(10,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT04     DFHMDF POS=(10,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH04     DFHMDF POS=(10,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP04     DFHMDF POS=(10,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT05     DFHMDF POS=(11,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE05     DFHMDF POS=(11,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP05     DFHMDF POS=(11,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN05     DFHMDF POS=(11,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC05     DFHMDF POS=(11,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS05     DFHMDF POS=(11,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT05     DFHMDF POS=(11,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH05     DFHMDF POS=(11,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP05     DFHMDF POS=(11,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT06     DFHMDF POS=(12,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE06     DFHMDF POS=(12,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP06     DFHMDF POS=(12,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN06     DFHMDF POS=(12,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC06     DFHMDF POS=(12,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS06     DFHMDF POS=(12,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT06     DFHMDF POS=(12,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH06     DFHMDF POS=(12,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP06     DFHMDF POS=(12,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT07     DFHMDF POS=(13,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE07     DFHMDF POS=(13,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP07     DFHMDF POS=(13,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN07     DFHMDF POS=(13,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC07     DFHMDF POS=(13,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS07     DFHMDF POS=(13,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT07     DFHMDF POS=(13,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH07     DFHMDF POS=(13,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP07     DFHMDF POS=(13,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT08     DFHMDF POS=(14,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE08     DFHMDF POS=(14,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP08     DFHMDF POS=(14,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN08     DFHMDF POS=(14,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC08     DFHMDF POS=(14,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS08     DFHMDF POS=(14,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT08     DFHMDF POS=(14,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH08     DFHMDF POS=(14,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP08     DFHMDF POS=(14,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT09     DFHMDF POS=(15,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE09     DFHMDF POS=(15,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP09     DFHMDF POS=(15,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN09     DFHMDF POS=(15,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC09     DFHMDF POS=(15,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS09     DFHMDF POS=(15,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT09     DFHMDF POS=(15,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH09     DFHMDF POS=(15,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP09     DFHMDF POS=(15,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
DT10     DFHMDF POS=(16,1),LENGTH=10,ATTRB=(ASKIP,NORM)
HE10     DFHMDF POS=(16,12),LENGTH=8,ATTRB=(ASKIP,NORM)
TP10     DFHMDF POS=(16,21),LENGTH=10,ATTRB=(ASKIP,BRT)
SN10     DFHMDF POS=(16,32),LENGTH=1,ATTRB=(ASKIP,BRT)
AC10     DFHMDF POS=(16,35),LENGTH=10,ATTRB=(ASKIP,BRT)
DS10     DFHMDF POS=(16,47),LENGTH=20,ATTRB=(ASKIP,NORM)
QT10     DFHMDF POS=(16,68),LENGTH=8,ATTRB=(ASKIP,NORM)
MH10     DFHMDF POS=(16,78),LENGTH=12,ATTRB=(ASKIP,NORM)
OP10     DFHMDF POS=(16,92),LENGTH=8,ATTRB=(ASKIP,NORM)
*
*-- TOTAUX LIGNES AFFICHEES
         DFHMDF POS=(18,2),LENGTH=14,ATTRB=(ASKIP,NORM),              X
               INITIAL='TOTAL MVTS   :'
TOTCNT   DFHMDF POS=(18,17),LENGTH=7,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(18,25),LENGTH=14,ATTRB=(ASKIP,NORM),             X
               INITIAL='MONTANT TOTAL:'
TOTMNT   DFHMDF POS=(18,40),LENGTH=15,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(18,56),LENGTH=3,ATTRB=(ASKIP,NORM),INITIAL='EUR'
*
MSGRTR   DFHMDF POS=(20,2),LENGTH=79,ATTRB=(ASKIP,BRT)
*
         DFHMDF POS=(22,2),LENGTH=65,ATTRB=(ASKIP,NORM),              X
               INITIAL='PF3=MENU  PF5=FILTRER  PF7=PAGE PREC.  PF8X
=PAGE SUIV.  PF12=RAZ'
*
         DFHMDF POS=(23,2),LENGTH=10,ATTRB=(ASKIP,NORM),              X
               INITIAL='OPERATEUR:'
OPENAM   DFHMDF POS=(23,13),LENGTH=10,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(23,24),LENGTH=9,ATTRB=(ASKIP,NORM),              X
               INITIAL='TERMINAL:'
TERNAM   DFHMDF POS=(23,34),LENGTH=10,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(23,80),LENGTH=7,ATTRB=(ASKIP,NORM),              X
               INITIAL='PAGE :'
PAGCUR   DFHMDF POS=(23,88),LENGTH=4,ATTRB=(ASKIP,BRT)
         DFHMDF POS=(23,93),LENGTH=1,ATTRB=(ASKIP,NORM),INITIAL='/'
PAGTOT   DFHMDF POS=(23,95),LENGTH=4,ATTRB=(ASKIP,NORM)
*
         DFHMSD TYPE=FINAL
         END
